#include<stdio.h>
#include<string.h>
#include<math.h>
#include<stdlib.h>


//习题1：交换两个整数变量，要求不能创建第三个变量即,a=1,b=2，交换之后a=2,b=1
//
//void Swap(int* p,int* p1)
//{
//
//	*p=*p^*p1;
//
//	// *p1=*p1^*p1^*p =0^*p=*p
//	*p1=*p1^*p;
//
//	// *p1^*p1^*p=0^*p=*p
//	*p=*p^*p1;
//
//	printf("a=%d,b=%d\n",*p,*p1);
//
//}
//
//int main()
//{
//	int a=1,b=2;
//
//	int *p,*p1;
//
//
//	p=&a;
//	p1=&b;
//
//	Swap(&a,&b);
//
//
//
//	return 0;
//}

//编程写代码实现:求一个整数储存在内存中的二进制中1的个数

//int main()
//{
//	int a=5;
//	int b=1;
//	int count=0;
//	int i=0;
//	//根据题目要求，算该数二进制中1的个数
//	//5的二进制代码:00000000000000000000000000000101
//	//1的二进制代码:00000000000000000000000000000001 
//
//	//              00000000000000000000000000000001  第一次相&结果
//
//	//			    00000000000000000000000000000000  第二次相&结果
//
//	//              00000000000000000000000000000100  第三次相&结果
////总结下来，通过移动1的位置与需要判断的数字进行想&可以得出结论，被判断的该bit位上只要有1，与1通过左移相&结果不为0，
//	//被判断的该bit位没有1，与1通过左移相&结果为0
//	/*printf("%d\n",sizeof(a)*8);*/
//	while(i< (sizeof(a)*8))
//	{
//		if((a & b)!=0)
//		{
//			count++;
//		}
//		b=b<<1;
//		i++;
//	}
//	printf("count=%d\n",count);
//	return 0;
//}


//数组注意事项

//int main()
//{
//	int a=10;
//	int arr[10]={0};
//	printf("%d\n",sizeof(arr));//数组名   40
//	
//	printf("%d\n",sizeof(int [10])); //数组类型   40
//
//	printf("%d\n",sizeof(a));// 4 
//	printf("%d\n",sizeof(int));//4
//	return 0;
//}

//sizeof 注意事项

//int main()
//{
//	short a=5;
//	int b=4;
//	printf("%d\n",sizeof(a=b+2)); //2  sizeof并没有真正意义上的运算，
//	printf("%d\n",a);//5 izeof并没有真正意义上的运算， 所以结果还是以前的5
//
//}


//把一个数的第n位是0置成1，然后在置回0
//int main()
//{
//	int a=0; 
//	int b=1;
//	int n;
//	char c[20];
//	char d[20];
//	int res;
//	//13的二进制为:00000000000000000000000001101   
//	//假设把13的第5位先置成1
//	//             00000000000000000000000010000    //这个二进制可以由1左移n位构成
//	//             00000000000000000000000011101
//	//把置成1后的数重新置回0
//	//			   00000000000000000000000010000 按位取反可以得出下面的式子
//	//             11111111111111111111111101111
//	//按位 &后     00000000000000000000000001101
//	printf("请输入一个数,和需要操作的第n位置成1:>\n");
//	//注意：输入格式位 13 5\n
//	/*scanf("%d%d\n",&a,&n);*/
//	//输入格式位:13 5
//	scanf("%d%d",&a,&n);
//	getchar();	
//	//10进制转成2进制字符串输出
//	itoa(a,c,2);
//	printf("a=%d\n二进制：%s\n",a,c);
//	res=a | (b<<n-1);
//	itoa(res,d,2);
//	printf("res=%d\n置成1后的二进制：%s\n",res,d);
//	if(res!=a)
//	{
//	res=res &(~(b<<n-1));
//	itoa(res,d,2);
//	printf("res=%d\n重新置成0后的二进制：%s\n",res,d);
//	}
//	else
//	{
//	 printf("不需要重新置成0，原位就是0\n");
//	}
//	
//	return 0;
//}



//给函数传参  传数组时应该注意的问题

//void test1(int arr[10])
//{
//	//为什么同样是数组，在main函数是40 在函数里面打印确实4呢
//	//因为传数组，本质上是传数组第一个元素的地址，所以这里用数组接收其实本质是用指针接收一个地址
//	//在32位系统下，指针的大小为4个字节(无论是int* char* )
//	//在64位系统下，指针的大小为8个字节(无论是int* char* )
//	printf("%d\n",sizeof(arr));//4
//
//}
//
//void test2(char ch[10])
//{
//
//	printf("%d\n",sizeof(ch));//4
//
//}
//int main()
//{
//	int arr[10]={0};
//	char ch[10]={0};
//
//	printf("%d\n",sizeof(arr));//40
//	printf("%d\n",sizeof(ch));//10
//	test1(arr);
//	test2(ch);
//	return 0;
//}



